Ran Plan for 3 projects:

1. project: `vpc` dir: `terraform/vpc` workspace: `default`
1. project: `eks` dir: `terraform/eks` workspace: `default`
1. project: `apps` dir: `terraform/apps` workspace: `default`
---

### 1. project: `vpc` dir: `terraform/vpc` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://0.0.0.0/lock?id=velychkov%252Fatlantis%252Fterraform%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p vpc
  ```

---
### 2. project: `eks` dir: `terraform/eks` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.0 plan -input=false -refresh -out "/atlantis-data/repos/velychkov/atlantis/1/default/terraform/eks/eks-default.tfplan" -var-file=env/dev.tfvars' in '/atlantis-data/repos/velychkov/atlantis/1/default/terraform/eks': exit status 1
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-05d30c4966786e1fb]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["ng-system"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-cluster/cluster]
module.eks.module.eks_managed_node_group["ng-system"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["ng-system"].data.aws_partition.current: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0be5bc62d4ae06dd9]
module.eks.module.eks_managed_node_group["ng-system"].data.aws_caller_identity.current: Read complete after 0s [id=524349720209]
module.eks.module.eks_managed_node_group["ng-system"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["ng-system"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=524349720209]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=524349720209]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.module.eks_managed_node_group["ng-system"].aws_iam_role.this[0]: Refreshing state... [id=ng-system-eks-node-group-20250517152832866300000001]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-cluster-cluster-20250517152832867100000004]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::524349720209:policy/my-cluster-cluster-20250517152832866900000003]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-960700415]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3624914878]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1292698269]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-281538224]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2927134412]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4154715254]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-4182385833]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3649407270]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-874624253]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2635906064]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3403265287]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 1s [id=arn:aws:sts::524349720209:assumed-role/eks-admin-role/1747662647025902489]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-cluster-cluster-20250517152832867100000004-20250517152834421500000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-cluster-cluster-20250517152832867100000004-20250517152834413900000007]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=my-cluster-cluster-20250517152832867100000004-20250517152834413000000006]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_managed_node_group["ng-system"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=ng-system-eks-node-group-20250517152832866300000001-2025051715283464940000000b]
module.eks.module.eks_managed_node_group["ng-system"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=ng-system-eks-node-group-20250517152832866300000001-2025051715283461970000000a]
module.eks.module.eks_managed_node_group["ng-system"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=ng-system-eks-node-group-20250517152832866300000001-20250517152834611900000009]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1813644712]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=d2277b64-dd85-4e4d-a5be-f6969001412e]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::524349720209:policy/my-cluster-cluster-ClusterEncryption2025051715285734280000000c]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/my-cluster]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=my-cluster]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=my-cluster:arn:aws:iam::524349720209:user/admin]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["amazon-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-045c329855052558d,Environment]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-045c329855052558d,Terraform]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=08332733484502a5c0ee4f44b59e6f9baaa72352]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=my-cluster-cluster-20250517152832867100000004-2025051715285827300000000d]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-05-17T15:38:37Z]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::524349720209:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/B735A2BBDBF7B0E2480D602A78FEFE64]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.module.eks_managed_node_group["ng-system"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2487976131856540961]
module.eks.module.eks_managed_node_group["ng-system"].aws_launch_template.this[0]: Refreshing state... [id=lt-00b600d02ed5d84f4]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=my-cluster#arn:aws:iam::524349720209:user/admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks_managed_node_group["ng-system"].aws_eks_node_group.this[0]: Refreshing state... [id=my-cluster:ng-system-20250517153844379700000012]
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster_auth.this: Read complete after 0s [id=my-cluster]
data.aws_eks_cluster.this: Reading...
data.aws_eks_cluster.this: Read complete after 0s [id=my-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-west-1:524349720209:access-entry/my-cluster/user/524349720209/admin/38cb6f72-9f03-5126-c90d-6c65d3d90096" -> (known after apply)
      ~ created_at        = "2025-05-17T15:38:07Z" -> (known after apply)
      ~ id                = "my-cluster:arn:aws:iam::524349720209:user/admin" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-05-17T15:38:07Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::524349720209:user/admin" -> "arn:aws:iam::524349720209:role/eks-admin-role" # forces replacement
        tags              = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
      ~ user_name         = "arn:aws:iam::524349720209:user/admin" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-05-17 15:38:08.684 +0000 UTC" -> (known after apply)
      ~ id            = "my-cluster#arn:aws:iam::524349720209:user/admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-05-17 15:38:08.684 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::524349720209:user/admin" -> "arn:aws:iam::524349720209:role/eks-admin-role" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "d2277b64-dd85-4e4d-a5be-f6969001412e"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::524349720209:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::524349720209:user/admin" -> "arn:aws:iam::524349720209:role/eks-admin-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::524349720209:role/my-cluster-cluster-20250517152832867100000004"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "Terraform"             = "true"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
╷
│ Error: reading EKS Add-On version info (amazon-ebs-csi-driver, 1.31): empty result
│ 
│   with module.eks.data.aws_eks_addon_version.this["amazon-ebs-csi-driver"],
│   on .terraform/modules/eks/main.tf line 730, in data "aws_eks_addon_version" "this":
│  730: data "aws_eks_addon_version" "this" {
│ 
╵


```
</details>

---
### 3. project: `apps` dir: `terraform/apps` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.0 plan -input=false -refresh -out "/atlantis-data/repos/velychkov/atlantis/1/default/terraform/apps/apps-default.tfplan" -var-file=env/dev.tfvars' in '/atlantis-data/repos/velychkov/atlantis/1/default/terraform/apps': exit status 1
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.eks: Read complete after 1s
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster.this: Reading...
data.aws_iam_openid_connect_provider.oidc_provider_arn: Reading...
data.aws_iam_openid_connect_provider.oidc_issuer_url: Reading...
aws_iam_policy.alb_ingress_policy: Refreshing state... [id=arn:aws:iam::524349720209:policy/AWSLoadBalancerControllerIAMPolicy]
data.aws_eks_cluster_auth.this: Read complete after 0s [id=my-cluster]
data.aws_eks_cluster.this: Read complete after 0s [id=my-cluster]
data.aws_iam_openid_connect_provider.oidc_provider_arn: Read complete after 0s [id=arn:aws:iam::524349720209:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/B735A2BBDBF7B0E2480D602A78FEFE64]
data.aws_iam_openid_connect_provider.oidc_issuer_url: Read complete after 0s [id=arn:aws:iam::524349720209:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/B735A2BBDBF7B0E2480D602A78FEFE64]
helm_release.atlantis: Refreshing state... [id=atlantis]
data.aws_iam_policy_document.alb_ingress: Reading...
data.aws_iam_policy_document.eks_assume_role_admin: Reading...
data.aws_iam_policy_document.eks_assume_role_read_only: Reading...
data.aws_iam_policy_document.eks_assume_role_read_only: Read complete after 0s [id=2225590153]
data.aws_iam_policy_document.alb_ingress: Read complete after 0s [id=1287474383]
data.aws_iam_policy_document.eks_assume_role_admin: Read complete after 0s [id=421162351]
aws_iam_role.eks_read_only: Refreshing state... [id=eks-read-only-role]
aws_iam_role.alb_ingress: Refreshing state... [id=alb-ingress-controller]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin-role]
kubernetes_service_account.alb_sa: Refreshing state... [id=kube-system/aws-load-balancer-controller]
aws_iam_role_policy_attachment.alb_ingress_attach: Refreshing state... [id=alb-ingress-controller-20250518172948638800000002]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-role-20250518172948632200000001]
kubernetes_service_account.eks_admin_sa: Refreshing state... [id=default/eks-admin]
aws_iam_role_policy_attachment.eks_read_only_attach: Refreshing state... [id=eks-read-only-role-20250518172948717100000003]
kubernetes_service_account.eks_read_only_sa: Refreshing state... [id=default/eks-read-only]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Kubernetes cluster unreachable: the server has asked for the client to provide credentials
│ 
│   with helm_release.atlantis,
│   on atlantis.tf line 1, in resource "helm_release" "atlantis":
│    1: resource "helm_release" "atlantis" {
│ 
╵
╷
│ Error: Unauthorized
│ 
│   with kubernetes_service_account.alb_sa,
│   on sa.tf line 1, in resource "kubernetes_service_account" "alb_sa":
│    1: resource "kubernetes_service_account" "alb_sa" {
│ 
╵
╷
│ Error: Unauthorized
│ 
│   with kubernetes_service_account.eks_admin_sa,
│   on sa.tf line 12, in resource "kubernetes_service_account" "eks_admin_sa":
│   12: resource "kubernetes_service_account" "eks_admin_sa" {
│ 
╵
╷
│ Error: Unauthorized
│ 
│   with kubernetes_service_account.eks_read_only_sa,
│   on sa.tf line 22, in resource "kubernetes_service_account" "eks_read_only_sa":
│   22: resource "kubernetes_service_account" "eks_read_only_sa" {
│ 
╵


```
</details>

---
### Plan Summary

3 projects, 0 with changes, 1 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```